Revit 2027 API
RebarConstraint.IsUsingClearBarSpacing Method
 Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUsingClearBarSpacing()
Public Function IsUsingClearBarSpacing As Boolean
public:
bool IsUsingClearBarSpacing()
member IsUsingClearBarSpacing : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a Shape Driven Rebar element. -or- The RebarConstraint constrain two Rebar ends. -or- The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Remarks
Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.
Throws exception if the constraint is for a handle of a Free Form Rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace